results/saturate_ssd/cockroachdb/cockroachdb_minthroughput_disk_swapoff_results/exp2_trial_4.txt
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
[...]
Still waiting for thread Thread-198 to complete. Workload status: true
Still waiting for thread Thread-198 to complete. Workload status: true
Still waiting for thread Thread-198 to complete. Workload status: true
[...]
Still waiting for thread Thread-57 to complete. Workload status: true
Still waiting for thread Thread-19 to complete. Workload status: true
[OVERALL], RunTime(ms), 351381
[OVERALL], Throughput(ops/sec), 20.47634903423919
[TOTAL_GCS_Copy], Count, 11
[TOTAL_GC_TIME_Copy], Time(ms), 74
[TOTAL_GC_TIME_%_Copy], Time(%), 0.02105976134167755
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 11
[TOTAL_GC_TIME], Time(ms), 74
[TOTAL_GC_TIME_%], Time(%), 0.02105976134167755
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 81.1640625
[CLEANUP], MinLatency(us), 32
[CLEANUP], MaxLatency(us), 405
[CLEANUP], 99thPercentileLatency(us), 198
[CLEANUP], 99.9PercentileLatency(us), 405
[UPDATE], Operations, 7195
[UPDATE], AverageLatency(us), 1.0750949065740097E7
[UPDATE], MinLatency(us), 316160
[UPDATE], MaxLatency(us), 283115519
[UPDATE], 99thPercentileLatency(us), 67698687
[UPDATE], 99.9PercentileLatency(us), 186908671
[UPDATE], Return=OK, 7195