results/saturate_ssd/cockroachdb/cockroachdb_minthroughput_disk_swapoff_results/exp3_trial_2.txt
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 300636
[OVERALL], Throughput(ops/sec), 269.7813967721763
[TOTAL_GCS_Copy], Count, 13
[TOTAL_GC_TIME_Copy], Time(ms), 96
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03193230351654493
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 13
[TOTAL_GC_TIME], Time(ms), 96
[TOTAL_GC_TIME_%], Time(%), 0.03193230351654493
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 61.73828125
[CLEANUP], MinLatency(us), 33
[CLEANUP], MaxLatency(us), 449
[CLEANUP], 99thPercentileLatency(us), 153
[CLEANUP], 99.9PercentileLatency(us), 449
[UPDATE], Operations, 81106
[UPDATE], AverageLatency(us), 943991.5269153947
[UPDATE], MinLatency(us), 3094
[UPDATE], MaxLatency(us), 248512511
[UPDATE], 99thPercentileLatency(us), 6443007
[UPDATE], 99.9PercentileLatency(us), 167116799
[UPDATE], Return=OK, 81106